[{"title": "NASA's Mars Perseverance Rover Passes Flight Readiness Review", "preview": "​The agency's Mars 2020 mission has one more big prelaunch review – the Launch Readiness Review, on July 27."}, {"title": "NASA's Perseverance Rover 100 Days Out", "preview": "Mark your calendars: The agency's latest rover has only about 8,640,000 seconds to go before it touches down on the Red Planet, becoming history's next Mars car."}, {"title": "Newfound Martian Aurora Actually the Most Common; Sheds Light on Mars' Changing Climate", "preview": "A type of Martian aurora first identified by NASA’s MAVEN spacecraft in 2016 is actually the most common form of aurora occurring on the Red Planet, according to new results from the mission."}, {"title": "NASA Readies Perseverance Mars Rover's Earthly Twin ", "preview": "Did you know NASA's next Mars rover has a nearly identical sibling on Earth for testing? Even better, it's about to roll for the first time through a replica Martian landscape."}, {"title": "A Martian Roundtrip: NASA's Perseverance Rover Sample Tubes", "preview": "Marvels of engineering, the rover's sample tubes must be tough enough to safely bring Red Planet samples on the long journey back to Earth in immaculate condition. "}, {"title": "How NASA's Perseverance Mars Team Adjusted to Work in the Time of Coronavirus ", "preview": "Like much of the rest of the world, the Mars rover team is pushing forward with its mission-critical work while putting the health and safety of their colleagues and community first."}, {"title": "NASA Perseverance Mars Rover Scientists Train in the Nevada Desert", "preview": "Team members searched for signs of ancient microscopic life there, just as NASA's latest rover will on the Red Planet next year."}, {"title": "NASA's Curiosity Mars Rover Snaps Its Highest-Resolution Panorama Yet", "preview": "To go along with the stunning 1.8-billion-pixel image, a new video offers a sweeping view of the Red Planet."}, {"title": "NASA's Mars 2020 Rover Goes Coast-to-Coast to Prep for Launch", "preview": "The agency's first step in returning rocks from Mars just arrived at Kennedy Space Center. The Mars 2020 team now begins readying for a launch to the Red Planet this July."}, {"title": "While Stargazing on Mars, NASA's Curiosity Rover Spots Earth and Venus", "preview": "This new portrait of the Red Planet's neighbors was taken during a time when there's more dust in the air on Mars."}, {"title": "NASA, ULA Launch Mars 2020 Perseverance Rover Mission to Red Planet", "preview": "The agency's Mars 2020 mission is on its way. It will land at Jezero Crater in about seven months, on Feb. 18, 2021. "}, {"title": "NASA's Mars 2020 Comes Full Circle", "preview": "Aiming to pinpoint the Martian vehicle's center of gravity, engineers took NASA's 2,300-pound Mars 2020 rover for a spin in the clean room at JPL. "}, {"title": "NASA's Perseverance Mars Rover Gets Its Wheels and Air Brakes", "preview": "After the rover was shipped from JPL to Kennedy Space Center, the team is getting closer to finalizing the spacecraft for launch later this summer."}, {"title": "Heat and Dust Help Launch Martian Water Into Space, Scientists Find", "preview": "Scientists using an instrument aboard NASA’s Mars Atmosphere and Volatile EvolutioN, or MAVEN, spacecraft have discovered that water vapor near the surface of the Red Planet is lofted higher into the atmosphere than anyone expected was possible. "}, {"title": "MOXIE Could Help Future Rockets Launch Off Mars", "preview": "NASA's Perseverance rover carries a device to convert Martian air into oxygen that, if produced on a larger scale, could be used not just for breathing, but also for fuel."}]