[{"title": "AI Is Helping Scientists Discover Fresh Craters on Mars", "preview": "It's the first time machine learning has been used to find previously unknown craters on the Red Planet."}, {"title": "NASA's MAVEN Explores Mars to Understand Radio Interference at Earth", "preview": "NASA’s MAVEN spacecraft has discovered “layers” and “rifts” in the electrically charged part of the upper atmosphere of Mars."}, {"title": "NASA Establishes Board to Initially Review Mars Sample Return Plans", "preview": "The board will assist with analysis of current plans and goals for one of the most difficult missions humanity has ever undertaken."}, {"title": "NASA's Perseverance Rover Will Look at Mars Through These 'Eyes'", "preview": "A pair of zoomable cameras will help scientists and rover drivers with high-resolution color images."}, {"title": "Hear Audio From NASA's Perseverance As It Travels Through Deep Space", "preview": "The first to be rigged with microphones, the agency's latest Mars rover picked up the subtle sounds of its own inner workings during interplanetary flight."}, {"title": "The Launch Is Approaching for NASA's Next Mars Rover, Perseverance", "preview": "The Red Planet's surface has been visited by eight NASA spacecraft. The ninth will be the first that includes a roundtrip ticket in its flight plan. "}, {"title": "Three New Views of Mars' Moon Phobos", "preview": "Taken with the infrared camera aboard NASA's Odyssey orbiter, they reveal temperature variations on the small moon as it drifts into and out of Mars’ shadow."}, {"title": "The Extraordinary Sample-Gathering System of NASA's Perseverance Mars Rover", "preview": "Two astronauts collected Moon rocks on Apollo 11. It will take three robotic systems working together to gather up the first Mars rock samples for return to Earth."}, {"title": "NASA's Mars Reconnaissance Orbiter Undergoes Memory Update", "preview": "Other orbiters will continue relaying data from Mars surface missions for a two-week period."}, {"title": "Scientists Explore Outback as Testbed for Mars ", "preview": "Australia provides a great place for NASA's Mars 2020 and the ESA-Roscosmos ExoMars scientists to hone techniques in preparation for searching for signs ancient life on Mars."}, {"title": "NASA's New Mars Rover Is Ready for Space Lasers", "preview": "Perseverance is one of a few Mars spacecraft carrying laser retroreflectors. The devices could provide new science and safer Mars landings in the future."}, {"title": "NASA to Reveal Name of Its Next Mars Rover", "preview": "After a months-long contest among students to name NASA's newest Mars rover, the agency will reveal the winning name — and the winning student — this Thursday. "}, {"title": "Naming a NASA Mars Rover Can Change Your Life", "preview": "Want to name the robotic scientist NASA is sending to Mars in 2020? The student who named Curiosity — the rover currently exploring Mars — will tell you this is an opportunity worth taking."}, {"title": "NASA's Perseverance Rover 100 Days Out", "preview": "Mark your calendars: The agency's latest rover has only about 8,640,000 seconds to go before it touches down on the Red Planet, becoming history's next Mars car."}, {"title": "NASA's Curiosity Keeps Rolling As Team Operates Rover From Home", "preview": "The team has learned to meet new challenges as they work remotely on the Mars mission."}]